In [1]:
import pandas as pd

In [4]:
df=pd.read_csv("Emp by sector and region.csv")

In [6]:
df.head(10)

,Statistic Label,Year,Region,Sector,UNIT,VALUE
0,Total Employment,2000,Ireland,All selected NACE sectors ( A-S),Person,310464.0
1,Total Employment,2000,Ireland,"Agriculture, forestry & fishing, mining & quar...",Person,52452.0
2,Total Employment,2000,Ireland,"Traditional Manufacturing (13 -18, 22-25, 28-3...",Person,90200.0
3,Total Employment,2000,Ireland,"Modern Manufacturing (19-21, 26-27, 325)",Person,87248.0
4,Total Employment,2000,Ireland,"Energy, Water, Waste & Construction (D to F)",Person,6751.0
5,Total Employment,2000,Ireland,Information & Communication Services (J),Person,54032.0
6,Total Employment,2000,Ireland,"Selected services (G to I, K to S)",Person,19779.0
7,Total Employment,2000,Border,All selected NACE sectors ( A-S),Person,24385.0
8,Total Employment,2000,Border,"Agriculture, forestry & fishing, mining & quar...",Person,6631.0
9,Total Employment,2000,Border,"Traditional Manufacturing (13 -18, 22-25, 28-3...",Person,10537.0

In [7]:
df.shape

(1386, 6)

In [9]:
df.dtypes

Statistic Label     object
Year                 int64
Region              object
Sector              object
UNIT                object
VALUE              float64
dtype: object

In [14]:
df["Sector"].unique()

array(['All selected NACE sectors ( A-S)',
       'Agriculture, forestry & fishing, mining & quarrying, food, beverages and tobacco (A, B, 10, 11,12)',
       'Traditional Manufacturing (13 -18, 22-25, 28-32.4, 32.9-33)',
       'Modern Manufacturing\xa0(19-21, 26-27, 325)',
       'Energy, Water, Waste & Construction (D to F)',
       'Information & Communication Services (J)',
       'Selected services (G to I, K to S)'], dtype=object)

In [11]:
df.isnull().sum()

Statistic Label     0
Year                0
Region              0
Sector              0
UNIT                0
VALUE              76
dtype: int64

In [12]:
df.describe()

              Year          VALUE
count  1386.000000    1310.000000
mean   2010.500000   20150.031298
std       6.346579   42772.098865
min    2000.000000      26.000000
25%    2005.000000    2982.250000
50%    2010.500000    7159.000000
75%    2016.000000   18070.500000
max    2021.000000  419041.000000